{
    "01161": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `abnormal_hands.png` generated by an AI model, containing a young girl raising her hands. However, there are obvious defects with the hands. Try to refine the image to make the hands look realistic. The result should be an image maintaining most of the original content, but with improved hands.",
        "keynode": "./dataset/workflow_comfybench/keynode/character_face_refinement.py"
    },
    "01162": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `old_photo.jpg` of an old photo that is unclear and black-and-white. Restore the photo so that it is clear and colorful. The result should be a high-quality image.",
        "keynode": "./dataset/workflow_comfybench/keynode/image_super_resolution.py"
    },
    "01163": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "Generate a poster for a series named \"Breaking Bad\". The result should be a vertical image of the main character, Walter White, wearing a white vest with a serious expression, standing in front of a motorhome in the desert. The title \"Breaking Bad\" should be displayed in the top center of the image, followed by the tagline \"Say my name\".",
        "keynode":  [
            "./dataset/workflow_comfybench/keynode/text_to_image.py",
            "./dataset/workflow_comfybench/keynode/image_text_overlay.py"
        ]
    },
    "01164": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `large_castle.png` of a large castle standing on top of a hill. Stylize the castle with a whimsical \"ice cream\" aesthetic while maintaining its original structure. The result should be an image with the castle transformed into a colorful and fantastic ice cream castle.",
        "keynode": "./dataset/workflow_comfybench/keynode/image_style_cloning.py"
    },
    "01165": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `toy_dog.jpg` of a furry toy dog. Transform the toy dog into a golden statue with intricate details and a shiny surface. The result should be an image of a golden dog statue with similar details as the original toy dog.",
        "keynode": "./dataset/workflow_comfybench/keynode/image_style_cloning.py"
    },
    "01166": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `yellow_race.png`, which is a photo of an Asian male. Try to modify the character into a white male with white skin. The result should be a realistic image with the facial features preserved.",
        "keynode": "./dataset/workflow_comfybench/keynode/character_face_refinement.py"
    },
    "01167": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "Generate an image of a comic strip with four panels. The first panel should show a man waking up in bed, the second panel should show him looking at his smartphone, the third panel should show the smartphone displaying that it is Sunday, and the fourth panel should show the man continue to lie in bed. The result should be of high quality and visually appealing, with each panel clearly depicting the described scene.",
        "keynode": "./dataset/workflow_comfybench/keynode/text_to_image.py"
    },
    "01168": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `elon_musk.jpg`, which is a photo of Elon Musk. Convert the photo into an identification photo format so that only the head and shoulders are visible, and the background is plain red. The result should be a high-quality image suitable for an identification card.",
        "keynode": "./dataset/workflow_comfybench/keynode/character_portrait_conversion.py"
    },
    "01169": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "Design a book cover for a novel titled \"A Song of Ice and Fire\". The cover should feature a dragon breathing fire, a snowy landscape, and a sword. The title of the book together with the author's name \"George R. R. Martin\" should be displayed prominently on the cover. The result should be an image of a visually striking book cover.",
        "keynode": [
            "./dataset/workflow_comfybench/keynode/text_to_image.py",
            "./dataset/workflow_comfybench/keynode/image_text_overlay.py"
        ]
    },
    "01170": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `lovely_man.jpg`, which is a photo of a male celebrity. Transform the man in the image into a beautiful woman with ponytail hair while preserving the facial identity. The result should be a realistic image of a woman with the same identity as the original man.",
        "keynode": "./dataset/workflow_comfybench/keynode/character_portrait_conversion.py"
    },
    "01171": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `cosmetic_product.jpg`, which contains two bottles of cosmetic products illuminated by a soft yellow light. Modify the illumination into a bright pink light to create a more vibrant and attractive appearance. The result should be an image of the cosmetic products with the new illumination.",
        "keynode": "./dataset/workflow_comfybench/keynode/creative_image_repaint.py"
    },
    "01172": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `jacket_man.jpg`, which is a photo of a man wearing a black jacket. Change the black jacket into a white hoodie while ensuring that the modification looks natural and realistic. The result should be a high-quality image of the man wearing a white hoodie.",
        "keynode": "./dataset/workflow_comfybench/keynode/creative_image_repaint.py"
    },
    "01173": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `young_man.jpg`, which is a photo of a young man. Generate another photo to show the man as an elderly version of himself, with wrinkles, gray hair, and other signs of aging, while preserving his identity. The result should be a realistic image of an older man.",
        "keynode": "./dataset/workflow_comfybench/keynode/character_face_refinement.py"
    },
    "01174": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "Generate an image of a handwritten letter on a piece of paper. The letter should be addressed to \"My Darling\"  and signed with the name \"Juliet\". The content of the letter should express love and longing. The result should be an image of the handwritten letter, with readable and reasonable text.",
        "keynode": [
            "./dataset/workflow_comfybench/keynode/text_to_image.py",
            "./dataset/workflow_comfybench/keynode/image_text_overlay.py"
        ]
    },
    "01175": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `bareheaded_man.png`, which is a photo of a bareheaded man. Modify the image to add curly hair with medium length to the man while ensuring that the hairstyle looks natural and realistic. The result should be an image of the man where only the hairstyle is changed.",
        "keynode": "./dataset/workflow_comfybench/keynode/character_face_refinement.py"
    },
    "01176": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `red_bridge.jpg` of a red bridge. Change the brick material of the arch above the bridge into a metallic material with a reflective surface. The result should be an image of the bridge with the modified arch material.",
        "keynode": "./dataset/workflow_comfybench/keynode/subtle_image_repaint.py"
    },
    "01177": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "Generate an interior plan for a house from a top-down perspective. The plan should include a living room, a kitchen, a bedroom, and a bathroom, with furniture and appliances arranged in a realistic and reasonable layout. The result should be a high-quality image of the interior plan.",
        "keynode": "./dataset/workflow_comfybench/keynode/image_area_composition.py"
    },
    "01178": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "Generate an image of a landscape with a visible watermark in the bottom right corner. The watermark should consist of the text \"Sample Watermark\" in a stylish and elegant font. The result should be an image of the landscape with the watermark.",
        "keynode": "./dataset/workflow_comfybench/keynode/image_text_overlay.py"
    },
    "01179": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `watermarked_photo.png`, which is a photo of mountains and rivers with a visible watermark in the bottom right corner. Remove the watermark from the image while maintaining the quality and content of the original photo. The result should be a high-quality image without the watermark.",
        "keynode": "./dataset/workflow_comfybench/keynode/character_face_refinement.py"
    },
    "01180": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `president_trump.jpg`, which is a photo of Donald Trump. Generate an image of a clay sculpture based on the photo, which preserves the facial features and clothing details of the original image. The result should be a 3D-like image of a clay sculpture with a cartoonish style.",
        "keynode": "./dataset/workflow_comfybench/keynode/character_portrait_conversion.py"
    },
    "01181": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `red_bridge.jpg`, which is a photo of a red bridge with a person standing on it. Remove the person from the image while maintaining the original appearance of the bridge. The result should be an image of the bridge without the human element.",
        "keynode": "./dataset/workflow_comfybench/keynode/remove_any_object.py"
    },
    "01182": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `taylor_swift.mp4`, which is a video of Taylor Swift speaking on stage. Swap the face of Taylor Swift with the face of `Emma_Watson.png` in the video while preserving the facial expressions and lip movements. The result should be a video of Emma Watson speaking with the other elements unchanged.",
        "keynode": "./dataset/workflow_comfybench/keynode/character_face_swap.py"
    },
    "01183": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "video"
        ],
        "content": "Generate a 3-second video composed of two clips. The first clip should show a sunrise over the mountains, and the second clip should show a sunset over the ocean. Create a smooth transition between the two clips, where the first clip fades into the second clip. The result should be a high-quality video with a seamless transition effect.",
        "keynode": "./dataset/workflow_comfybench/keynode/text_to_video.py"
    },
    "01184": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "video"
        ],
        "content": "Generate a 3-second video composed of two clips. The first clip should show a boy sitting on the grass, and the second clip should show a close-up of the boy. The two clips should be consistent in lighting and color tone. The result should be a high-quality video including a wide shot and a close-up shot.",
        "keynode": "./dataset/workflow_comfybench/keynode/text_to_video.py"
    },
    "01185": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `speaking_man.mp4` of an old man speaking. Generate a new video of a beautiful girl speaking with the same lip movements and facial expressions as the old man. The result should be a realistic video of a girl speaking.",
        "keynode": "./dataset/workflow_comfybench/keynode/character_face_swap.py"
    },
    "01186": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `male_idol.mp4` of a male idol dancing. Generate a new video of a panda dancing with the same movements as the male idol. The result should be a realistic video of a dancing panda.",
        "keynode": "./dataset/workflow_comfybench/keynode/image_pose_cloning.py"
    },
    "01187": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `male_idol.mp4` of a male idol dancing. Generate a new video of an animated cartoon character dancing with the same movements as the male idol. The result should be a cartoon-style video of a dancing cartoon character.",
        "keynode": "./dataset/workflow_comfybench/keynode/image_pose_cloning.py"
    },
    "01188": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `male_idol.mp4` of a male idol dancing in a room. Replace the background of the video with a football stadium filled with cheering fans. The result should be a video of the idol dancing in a football field.",
        "keynode": "./dataset/workflow_comfybench/keynode/replace_any_object.py"
    },
    "01189": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "video"
        ],
        "content": "You are given an image `president_trump.jpg`, which is a photo of Donald Trump. Generate a 3-second video of a cartoon version of Donald Trump talking on the stage with the same outfit as the original image. The result should be a video of a cartoon version of Donald Trump speaking.",
        "keynode": "./dataset/workflow_comfybench/keynode/image_to_video.py"
    },
    "01190": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "video"
        ],
        "content": "Generate a 3-second video showing the progression of a person's age from a baby to an elderly person. The video should include smooth transitions between different age stages, with each stage showing the person's face in detail. The result should be a high-quality video with consistent facial identity throughout the age progression.",
        "keynode": "./dataset/workflow_comfybench/keynode/text_to_video.py"
    },
    "01191": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "video"
        ],
        "content": "Generate a 3-second video showing the transition of seasons from winter to spring of the same landscape. The video should include changes in weather, vegetation, and lighting to depict the seasonal transition realistically. The result should be a high-quality video with smooth season transitions and consistent landscape elements.",
        "keynode": "./dataset/workflow_comfybench/keynode/text_to_video.py"
    },
    "01192": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "video"
        ],
        "content": "You are given an image `warm_bedroom.jpg`, which is a photo of a bedroom including a bed, a chair and some decorations. Generate a 3-second video based on the image to show the panoramic view of the bedroom from different angles. The result should be a video that explores the bedroom in a smooth manner.",
        "keynode": "./dataset/workflow_comfybench/keynode/image_to_video.py"
    },
    "01193": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "video"
        ],
        "content": "Generate a 2-second video showing the animation of a logo. The logo should consist of a red dragon surrounded by flames, representing power and strength. The animation should include the dragon breathing fire and the flames flickering. The result should be a high-quality video of the logo animation.",
        "keynode": "./dataset/workflow_comfybench/keynode/text_to_video.py"
    },
    "01194": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a image `old_photo.jpg`, which is a black-and-white photo of a woman. Modify the photo into a 2-second colorful video of the woman turning her head and smiling. The result should be a colorful video of the woman based on the original photo.",
        "keynode": "./dataset/workflow_comfybench/keynode/text_to_video.py"
    },
    "01195": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `two_babies.mp4` of two babies watching a laptop screen in a bright bedroom. Modify the illumination of the video as a night scene with a soft moonlight shining through the window. The result should be a video of the babies in a night scene with other elements unchanged.",
        "keynode": "./dataset/workflow_comfybench/keynode/object_scene_enhancement.py"
    },
    "01196": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `speaking_man.mp4` of an old man wearing a white cap speaking. Remove the cap from his head while maintaining the consistency between the man and the background. The result should be a video of the old man speaking without the cap with other elements unchanged.",
        "keynode": "./dataset/workflow_comfybench/keynode/remove_any_object.py"
    },
    "01197": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `baseball_game.mp4` of a baseball game with low resolution and blurry frames. Refine the video to make the frames clear and sharp. The result should be a high-quality video of the baseball game with improved visual quality.",
        "keynode": "./dataset/workflow_comfybench/keynode/image_super_resolution.py"
    },
    "01198": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `pour_water.mp4` of pouring water into a white ceramic cup. Change the cup material into a silver metallic cup with a reflective surface. The result should be a video of pouring water into the silver cup with other elements unchanged.",
        "keynode": "./dataset/workflow_comfybench/keynode/replace_any_object.py"
    },
    "01199": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `passing_car.mp4` of a gray car passing by on the road. Change the car color into red while maintaining the consistency of the video. The result should be a video of a red car passing by on the road with other elements unchanged.",
        "keynode": "./dataset/workflow_comfybench/keynode/replace_any_object.py"
    },
    "01200": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `male_idol.mp4` of a male idol dancing in a room. Convert the video into a sketch-style animation with black strokes and white background. The result should be a sketch-style video of the idol dancing while maintaining the original elements and movements.",
        "keynode": "./dataset/workflow_comfybench/keynode/text_to_video.py"
    }
}